app/views/search/_searchBarResults.html.erb

					<li>
						<%= link_to u.first_name + " " + u.last_name, :controller => "users", :action => "show", :id => u.id %>
---
SELECT "users".* FROM "users" WHERE (lower(first_name) like '%ale%' or lower(last_name) like '%ale%')