app/views/users/_show_users_books.html.erb

SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = 1 ORDER BY title ASC
SELECT COUNT(*) FROM "books" INNER JOIN "libraries" ON "books"."id" = "libraries"."book_id" WHERE "libraries"."user_id" = 4
---

<% if @user.books.empty? %>