app/views/users/_user_profile_box.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2 AND (user_id = 2) AND (favorite_user_id = 1) LIMIT 1
---
	<% else %>
		<%= link_to "Remove " + @user.first_name + " from your favorites.", @current_user.favorites.first_entry(@current_user.id, @user.id), :class => "btn btn-danger favorite-button", :method => :delete %>