app/controllers/books_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def new
    @users = User.find(:all)

SELECT "books".* FROM "books" WHERE "books"."asin" = '0060934344' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "books" ("asin", "author", "cover_url", "created_at", "ean", "isbn", "link_to_amzn", "synopsis", "thumbnail_link", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "libraries" ("book_id", "user_id") VALUES (?, ?)  [["book_id", 1], ["user_id", 2]]
---
  def create
    asin = params[:asin] || params[:book][:asin]
    @book = AmazonCatalog.asinLookup(asin)
  	#check if the book exists (by isbn)
    if(Book.find_by_asin(@book.asin).nil?)
  		#try to save it, and render an error if it doesn't work
  		if(!@book.save)
  			flash[:error] = "There was an error saving your book.\n" + @book.errors.full_messages.join(",")
        @users = User.find(:all)
        render :controller => :books, :action => :new
        return
  		end
    else

      if(!@book.eql?(Book.find_by_asin(@book.asin)))
        Book.find_by_asin(@book.asin).update_from_amazon(@book)
      end
		  #retrieve the existing book from the database
      @book = Book.find_by_asin(@book.asin)
  	end

    @library_record = LibraryRecord.new
    @library_record.book_id = @book.id
    @library_record.user_id = @current_user.id
    @library_record.status = "Available"

    @library_record.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
---
  def get_remove_modal
      book = Book.find(params[:bookId])

SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = 1 ORDER BY title ASC
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "books_users" WHERE "books_users"."user_id" = 1 AND "books_users"."book_id" IN (4)
---
  def remove
      books = User.find_by_id(params[:userId]).books
      books.each do |b|
        if b.id = params[:bookId]
          books.delete(b)

SELECT "books".* FROM "books" WHERE "books"."asin" = '0060934344' LIMIT 1
---
  def index
    @book = Book.find_by_asin(params[:id]) || AmazonCatalog.asinLookup(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
  def show
    @book = Book.find_by_id(params[:id]) # no security issue here right?