app/controllers/favorites_controller.rb

def create
	@favorites = current_user.favorites.build(:favorite_user_id => params[:favorite_user_id])
	if @favorites.save
---
INSERT INTO "favorites" ("created_at", "favorite_user_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 06 Sep 2012 02:14:42 UTC +00:00], ["favorite_user_id", 1], ["updated_at", Thu, 06 Sep 2012 02:14:42 UTC +00:00], ["user_id", 2]]

  def destroy
	@favorite = current_user.favorites.find(params[:id])
	@favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2 AND "favorites"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]