app/controllers/locations_controller.rb

INSERT INTO "locations" ("address1", "address2", "address3", "city", "created_at", "is_default", "short_name", "state", "updated_at", "user_id", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@location = Location.new(params[:location])

		if(@location.save)

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "locations" SET "short_name" = 'x', "updated_at" = '2012-09-19 22:22:38.171858' WHERE "locations"."id" = 1
---
	def update
		if !params[:location][:id].empty?
			@location = Location.find(params[:location][:id])
			if(@location.update_attributes(params[:location]))