app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'awcheng@stanford.edu' LIMIT 1
---
  def login_post
    @user = User.find_by_email(params[:user][:email])