app/controllers/search_controller.rb

	def searchBarSearch
	    searchType = params[:searchType]


	    a = Array.new

	    if searchType.eql?("user")
	    	@users = User.find(:all, :conditions=> ["lower(first_name) like :st or lower(last_name) like :st", {:st => "%" + params[:searchText].downcase + "%"}])
	    elsif searchType.eql?("title")
	    	@books = Book.find(:all, :conditions=> ["lower(title) like :st", {:st => "%" + params[:searchText].downcase + "%"}])
---
SELECT "users".* FROM "users" WHERE (lower(first_name) like '%ale%' or lower(last_name) like '%ale%')
SELECT "books".* FROM "books" WHERE (lower(author) like '%ale%')