app/controllers/users_controller.rb

  def create
		@user = User.new(params[:user])

		if(params[:sign_up_code].eql?("tooshualpha"))

			if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "profile_picture_content_type", "profile_picture_file_name", "profile_picture_file_size", "profile_picture_updated_at", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
		if params[:id].to_i.eql?(@current_user.id)
			redirect_to :controller => :users, :action => :home
		else
			@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def update
		@user = User.find(params[:id])
		puts "User:" + @user.to_s

		#only the logged in user should be able to make these changes
		if(@current_user.id.eql?(@user.id))
			if(params[:user][:password].nil?)
				@user.updating_password = false #required to bypass validation
				if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "first_name" = 'Cod', "updated_at" = '2012-10-02 04:25:30.515569' WHERE "users"."id" = 1

  def books
		if params[:id].nil? || params[:id].to_i.eql?(@current_user.id)
			@user = current_user
		else
			@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1